[options]
mode bmc
depth 20
#set-init-zero   A ChatGPT hallucination.

[script]
read_verilog -sv /home/owais/conversion-to-TLV/history/1/mod_0/or_gate.v
#prep -top or_gate  # ChatGPT suggests to uncomment.
rename or_gate or_gate_original

read_verilog -sv /home/owais/conversion-to-TLV/or_gate.v
#prep -top or_gate  # ChatGPT suggests to uncomment.
#rename or_gate or_gate_modified

miter -equiv -make_assert -flatten or_gate_original or_gate miter_circuit
prep -top miter_circuit

# Define reset behavior
setattr -unset init miter_circuit   # Needed first to set properties below, then reenabled.
chformal -assume -early miter_circuit   # The -assume flag sets a property as an assumption, and -early applies this assumption early in the process.
chformal -live -fair -cover -remove miter_circuit   # remove certain types of formal properties from the design
setattr -set init miter_circuit   # reenable.
chformal -init-ones reset -module miter_circuit
chformal -init-zero -from 5 reset -module miter_circuit

[engines]
smtbmc  # z3, yices, boolector
