verilog_defaults -add -D CHECK_OUTPUTS
read_verilog -sv ../../../partitions/adder.carry.sv
read_ilang ../../../partitions/adder.carry.il
hierarchy -top miter; proc; chformal -cover -remove
async2sync
formalff -clk2ff -ff2anyinit gate.adder.carry
setundef -anyseq gate.adder.carry
flatten -wb; dffunmap; opt_expr -keepdc -undriven; opt_clean
sat -tempinduct -set-init-undef -set-def-formal -set-def-inputs -maxsteps 2 -set-assumes -prove-asserts -show-public -dump_vcd trace.vcd miter
